
[
    {
    "name": "Meghan Yahrling",
    "location": "Cherry Hill, New Jersey 08034",
    "phoneNumber": "267-415-8941",
    "description": "I’m a Licensed Professional Counselor with roughly six years of experience working in various clinical settings such as Intensive Outpatient Programs and Private Practice. While working together, we can collaborate on techniques and approaches that are suited to you and your individual needs. We will use a holistic, whole-self approach to explore the different areas of life that are being effected while taking into account all parts of your mind, body, and spirit./r/r  In the work that I do, I help those who are struggling with feelings of depression and anxiety as well as those who are managing stressful life transitions. As we are working through what you’re dealing with, there will be an underlying theme of reconnecting with the self to better understand your wants and needs as well as how to show up authentically in all areas of life. Stepping into the space of therapy can be frightening but there is comfort in knowing that you are not alone & are worthy of feeling seen and heard.",
    "id": 1001,
    "imageName": "emptyprofile_1"
    },
    {
    "name": "Christy Hudak",
    "location": "Jersey City, New Jersey 07310",
    "phoneNumber": "908-460-7312",
    "description": "I utilize a combination of DBT and CBT therapy, in order to help clients identify maladaptive and self-defeating thought patterns that perpetuate their symptoms. I strive to help each of my clients achieve a better quality of life through education on cognitive distortions, the realization of behavioral patterns, goal development, and establishing coping skills.",
    "id": 1002,
    "imageName": "emptyprofile_2"
    },
    {
    "name": "Joseph Coleman",
    "location": "306 Washington #202 Hoboken, New Jersey 07030",
    "phoneNumber": "862-701-1884",
    "description": "Hello, my name is Joe Coleman. Do you want to learn about yourself? Do you want to better understand your anxieties, your emotions, and how to manage them? Do you crave more satisfying relationships and a better work-life balance?/r/r I'm here for you or your adolescent child.Offering in-person and virtual therapy for adults and adolescents.We use our therapy relationship to learn the importance of connection./r/r Through this you develop insight into who you are and how you can better manage your emotions. This leads to flexibility in managing emotional upset and relationship trouble. This approach is effective for adults and adolescents.",
    "id": 1003,
    "imageName": "emptyprofile_3"
    },
    {
    "name": "Debeka Bennett",
    "location": "Somerset, New Jersey 08873",
    "phoneNumber": "862-500-3286",
    "description": "my goal is to help you strengthen your self-awareness and self-esteem so that you can feel confident discerning the type of person you want to evolve into and make decisions that align with who you are at your core./r/r I enjoy working with individuals from diverse cultural backgrounds striving to foster healthy relationships, friendships, and family dynamics. Together we can figure out where you are feeling stuck and the steps you can take to get closer to having a better relationship with yourself and the people you care about in your life./r/r Relationships come with challenges, but with the right tools, you can better navigate situations that provide space for you to communicate your thoughts and emotions that reflect how you genuinely feel. I look forward to working alongside you to address the challenges you experience with nurturing a better relationship with yourself, your partner, andor your loved ones.",
    "id": 1004,
    "imageName": "emptyprofile_4"
    },
    {
        "name": "Kevin Drab",
        "location": "16 N. Franklin Street Suite #112-4 Doylestown, Pennsylvania 18901",
        "phoneNumber": "610-601-3868 ",
        "description": "Results focused therapy. I specialize in treating PTSD and Complex Trauma, anxiety disorders, Obsessive-Compulsive Disorder, suicidal tendencies, grieving survivors of suicide, sleep problems, chronic pain, drug and or alcohol problems, and depression. I am committed to working with you to successfully resolve your problem using a wide range of rich therapeutic approaches. Well-known for my active and resourceful approach, I consider your time valuable, and avoid dwelling on nonessentials and aimless talking, focusing instead on developing actions and solutions drawing from a wide-variety of therapies, you can apply immediately. I am knowledgeable in (and teach) psychopharmacology and welcome the opportunities to work in collaboration with the prescribing doctor, especially when side-effects, residual symptoms, or adherence are of concern. Significant others may be involved in the therapeutic process when appropriate./r/r Fee for service only. Can provide receipts for reimbursement from your insurance or Flex Plan. Charge for an hour's session is $130./r/r Trauma, anxiety disorders, depression, grief, suicide and suicide survivors - I have personal experience in these areas, as well as extensive training and practice.",
        "id": 1005,
        "imageName": "emptyprofile_1"
        }
]

